---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralBeamStartAttachmentDistance
source: html/b71289af-7ab6-ca4c-41d7-c55449f60910.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralBeamStartAttachmentDistance Property

"Start Attachment Distance"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralBeamStartAttachmentDistance { get; }
```